# SQL Analytics for Northwind Traders

In this project, I'm working with the Northwind database, a sample database originally provided by Microsoft for its Access Database Management System. It's based on a fictitious company named "Northwind Traders" and contains data on customers, orders, products, suppliers, and other aspects of the business.

I've chosen to work with a [PostgreSQL version of Northwind](https://github.com/pthom/northwind_psql/tree/master) for this analysis.

My goal is to extract meaningful business insights using advanced SQL techniques such as window functions and Common Table Expressions (CTEs). Through this project, I aim to demonstrate my SQL skills by answering these key business questions:

1. [Which employees generate the most revenue?](#section1)
2. [How are sales accumulating over time?](#section2)
3. [What are the monthly and yearly sales growth patterns?](#section3)

For reference, here's the schema diagram from the database's [GitHub page](https://github.com/pthom/northwind_psql/tree/master):

<img src="https://raw.githubusercontent.com/pthom/northwind_psql/master/ER.png" />

### Setup database connection

The following database credentials (postgres:postgres) are non-sensitive default values from the Northwind example Docker container from [this GitHub repository](https://github.com/pthom/northwind_psql/tree/master). This is a local Docker instance running on a non-standard port (55432). For production databases or databases with sensitive information, environment variables or other secure credential management would be used instead.

In [ ]:
%load_ext sql
from sqlalchemy import create_engine

# Database connection parameters
db_url = "postgresql://postgres:postgres@localhost:55432/northwind"
engine = create_engine(db_url)

# Register the sqlalchemy engine with sql magic
%sql engine

# Configure sql magic to display all results
%config SqlMagic.displaylimit = 0

# Disable named parameters to prevent postgres syntax issues like ::DECiMAL
%config SqlMagic.named_parameters="disabled"

<a id='section1'></a>
### Task 1: Which employees generate the most revenue?

In this analysis, I rank employees by their total sales amounts to identify top performers.

In [2]:
%%sql
WITH employee_sales AS (
    SELECT
        e.employee_id,
        e.first_name || ' ' || e.last_name AS employee_name,
        ROUND(
            SUM(od.unit_price * (1 - od.discount) * od.quantity)::DECIMAL,
            2) AS total_sales
    FROM employees e
    JOIN orders o ON e.employee_id = o.employee_id
    JOIN order_details od ON o.order_id = od.order_id
    GROUP BY e.employee_id
)
SELECT
    *,
    RANK() OVER (ORDER BY total_sales DESC) sales_rank
FROM employee_sales;

Running query in 'postgresql://postgres:***@localhost:55432/northwind'

9 rows affected.

+-------------+------------------+-------------+------------+
| employee_id |  employee_name   | total_sales | sales_rank |
+-------------+------------------+-------------+------------+
|      4      | Margaret Peacock |  232890.85  |     1      |
|      3      | Janet Leverling  |  202812.84  |     2      |
|      1      |  Nancy Davolio   |  192107.60  |     3      |
|      2      |  Andrew Fuller   |  166537.76  |     4      |
|      8      |  Laura Callahan  |  126862.28  |     5      |
|      7      |   Robert King    |  124568.23  |     6      |
|      9      |  Anne Dodsworth  |   77308.07  |     7      |
|      6      |  Michael Suyama  |   73913.13  |     8      |
|      5      | Steven Buchanan  |   68792.28  |     9      |
+-------------+------------------+-------------+------------+

<a id='section2'></a>
### Task 2: How are sales accumulating over time?

Here I calculate the running total of sales per month and a three-month moving average to visualize the sales trajectory and identify trends.

In [3]:
%%sql
WITH monthly_sales AS (
    SELECT
        DATE_TRUNC('month', o.order_date) AS month,
        TO_CHAR(DATE_TRUNC('month', o.order_date), 'YYYY-MM') AS month_label,
        SUM(od.unit_price * (1 - od.discount) * od.quantity) AS monthly_sales
    FROM orders o
    JOIN order_details od ON o.order_id = od.order_id
    GROUP BY DATE_TRUNC('month', o.order_date)
)
SELECT
    month_label,
    ROUND(monthly_sales::DECIMAL, 2) monthly_sales,
    ROUND(
        SUM(monthly_sales) OVER (ORDER BY month)::DECIMAL,
        2) AS cumulative_sales,
    ROUND(
        AVG(monthly_sales) OVER (
            ORDER BY month
            ROWS BETWEEN 2 PRECEDING AND CURRENT ROW
            )::DECIMAL,
        2) AS three_month_moving_avg
FROM monthly_sales
ORDER BY month;

Running query in 'postgresql://postgres:***@localhost:55432/northwind'

23 rows affected.

+-------------+---------------+------------------+------------------------+
| month_label | monthly_sales | cumulative_sales | three_month_moving_avg |
+-------------+---------------+------------------+------------------------+
|   1996-07   |    27861.90   |     27861.90     |        27861.90        |
|   1996-08   |    25485.28   |     53347.17     |        26673.59        |
|   1996-09   |    26381.40   |     79728.57     |        26576.19        |
|   1996-10   |    37515.72   |    117244.30     |        29794.13        |
|   1996-11   |    45600.05   |    162844.34     |        36499.06        |
|   1996-12   |    45239.63   |    208083.97     |        42785.13        |
|   1997-01   |    61258.07   |    269342.04     |        50699.25        |
|   1997-02   |    38483.63   |    307825.68     |        48327.11        |
|   1997-03   |    38547.22   |    346372.90     |        46096.31        |
|   1997-04   |    53032.95   |    399405.85     |        43354.60        |
|   1997-05   |    53781.29   |    453187.14     |        48453.82        |
|   1997-06   |    36362.80   |    489549.94     |        47725.68        |
|   1997-07   |    51020.86   |    540570.80     |        47054.98        |
|   1997-08   |    47287.67   |    587858.47     |        44890.44        |
|   1997-09   |    55629.24   |    643487.71     |        51312.59        |
|   1997-10   |    66749.23   |    710236.94     |        56555.38        |
|   1997-11   |    43533.81   |    753770.74     |        55304.09        |
|   1997-12   |    71398.43   |    825169.17     |        60560.49        |
|   1998-01   |    94222.11   |    919391.28     |        69718.12        |
|   1998-02   |    99415.29   |    1018806.57    |        88345.28        |
|   1998-03   |   104854.16   |    1123660.73    |        99497.18        |
|   1998-04   |   123798.68   |    1247459.41    |       109356.04        |
|   1998-05   |    18333.63   |    1265793.04    |        82328.82        |
+-------------+---------------+------------------+------------------------+

<a id='section3'></a>
### Task 3: What are the monthly and yearly sales growth patterns?

Here I calculate month-over-month and year-over-year sales growth to identify seasonal and overall trends.

In [4]:
%%sql
WITH monthly_sales AS (
    SELECT
        EXTRACT('year' from o.order_date) AS year,
        EXTRACT('month' from o.order_date) AS month,
        TO_CHAR(DATE_TRUNC('month', o.order_date), 'YYYY-MM') AS month_label,
        SUM(od.unit_price * (1 - od.discount) * od.quantity) AS monthly_sales
    FROM orders o
    JOIN order_details od ON o.order_id = od.order_id
    GROUP BY
        EXTRACT('year' from o.order_date),
        EXTRACT('month' from o.order_date),
        TO_CHAR(DATE_TRUNC('month', o.order_date), 'YYYY-MM')
),
sales_comparison AS (
    SELECT
        year,
        month,
        month_label,
        monthly_sales,
        LAG(monthly_sales) OVER (ORDER BY year, month) AS prev_month_sales,
        LAG(monthly_sales, 12) OVER (ORDER BY year, month) AS prev_year_sales
    FROM monthly_sales
)
SELECT
    month_label,
    ROUND(monthly_sales::DECIMAL, 2) AS monthly_sales,
    ROUND(prev_month_sales::DECIMAL, 2) AS prev_month_sales,
    ROUND(
        (100 * (monthly_sales - prev_month_sales) / prev_month_sales)::DECIMAL,
        2) AS monthly_growth_pct,
    ROUND(prev_year_sales::DECIMAL, 2) AS prev_year_sales,
    ROUND(
        (100 * (monthly_sales - prev_year_sales) / prev_year_sales)::DECIMAL,
        2) AS yearly_growth_pct
FROM sales_comparison;

Running query in 'postgresql://postgres:***@localhost:55432/northwind'

23 rows affected.

+-------------+---------------+------------------+--------------------+-----------------+-------------------+
| month_label | monthly_sales | prev_month_sales | monthly_growth_pct | prev_year_sales | yearly_growth_pct |
+-------------+---------------+------------------+--------------------+-----------------+-------------------+
|   1996-07   |    27861.90   |       None       |        None        |       None      |        None       |
|   1996-08   |    25485.28   |     27861.90     |       -8.53        |       None      |        None       |
|   1996-09   |    26381.40   |     25485.28     |        3.52        |       None      |        None       |
|   1996-10   |    37515.72   |     26381.40     |       42.21        |       None      |        None       |
|   1996-11   |    45600.05   |     37515.72     |       21.55        |       None      |        None       |
|   1996-12   |    45239.63   |     45600.05     |       -0.79        |       None      |        None       |
|   1997-01   |    61258.07   |     45239.63     |       35.41        |       None      |        None       |
|   1997-02   |    38483.63   |     61258.07     |       -37.18       |       None      |        None       |
|   1997-03   |    38547.22   |     38483.63     |        0.17        |       None      |        None       |
|   1997-04   |    53032.95   |     38547.22     |       37.58        |       None      |        None       |
|   1997-05   |    53781.29   |     53032.95     |        1.41        |       None      |        None       |
|   1997-06   |    36362.80   |     53781.29     |       -32.39       |       None      |        None       |
|   1997-07   |    51020.86   |     36362.80     |       40.31        |     27861.90    |       83.12       |
|   1997-08   |    47287.67   |     51020.86     |       -7.32        |     25485.28    |       85.55       |
|   1997-09   |    55629.24   |     47287.67     |       17.64        |     26381.40    |       110.87      |
|   1997-10   |    66749.23   |     55629.24     |       19.99        |     37515.72    |       77.92       |
|   1997-11   |    43533.81   |     66749.23     |       -34.78       |     45600.05    |       -4.53       |
|   1997-12   |    71398.43   |     43533.81     |       64.01        |     45239.63    |       57.82       |
|   1998-01   |    94222.11   |     71398.43     |       31.97        |     61258.07    |       53.81       |
|   1998-02   |    99415.29   |     94222.11     |        5.51        |     38483.63    |       158.33      |
|   1998-03   |   104854.16   |     99415.29     |        5.47        |     38547.22    |       172.01      |
|   1998-04   |   123798.68   |    104854.16     |       18.07        |     53032.95    |       133.44      |
|   1998-05   |    18333.63   |    123798.68     |       -85.19       |     53781.29    |       -65.91      |
+-------------+---------------+------------------+--------------------+-----------------+-------------------+